meeting/minutes/2024/05-07.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 076 Minutes 2024-05-07</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 076 Minutes 2024-05-07</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-5FD58640-0C4C-47AD-9DD2-CE42E3859295">1. Administrivia</a>
<ul>
<li><a href="#h-F610AA71-DC40-4E3E-A05D-568CABACE015">1.1. Roll call</a></li>
<li><a href="#h-B1C3720D-A852-416F-8CA8-F796F8B4928E">1.2. Approve the agenda</a></li>
<li><a href="#h-AD4E2248-E237-42B4-987B-745B7073F0BD">1.3. Approve minutes of previous meeting</a></li>
<li><a href="#h-6E415DD8-5C33-4E06-A5CA-DB9AC4955455">1.4. Next meeting</a></li>
<li><a href="#h-1C7F6C83-ADC6-4CE8-9C43-C68FC17DFCF3">1.5. Review of open action items <code>[1/7]</code></a></li>
<li><a href="#h-B9D86C17-B569-479B-9148-AA10721BBA6C">1.6. Review of open pull requests and issues</a>
<ul>
<li><a href="#h-2E27F717-E026-4E76-8867-3D13A65059E3">1.6.1. XSLT focused</a></li>
<li><a href="#h-777CB2A2-C144-480C-859C-1A2E43163364">1.6.2. Substantive PRs</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#h-92D0ACD0-9BC3-4389-9479-CBEBFC2419E2">2. Technical Agenda</a>
<ul>
<li><a href="#h-C7830527-6C52-4E7B-AFCF-A826F4B1F550">2.1. PR #1186: 1170 Editorial: fn:index-where</a></li>
<li><a href="#h-0B28CDC3-EB80-49BD-8171-A9E7BC2E019F">2.2. PR #1185: 1179 array:values, map:values → contents</a></li>
<li><a href="#h-D8882D53-D962-4A76-8AF6-68CCA1B84C9A">2.3. PR #1184: 1165-Use Unicode-style character references</a></li>
<li><a href="#h-55CEF04C-9E1E-48A3-A445-20A06CD23939">2.4. PR #1182: 1171 Change predicate</a></li>
<li><a href="#h-706A7B88-ABA8-4A39-A41C-D3FAF396F7E0">2.5. PR #1148: 1143 Coercion rules:</a></li>
</ul>
</li>
<li><a href="#h-BE122C76-CD86-48A2-9360-6E61E3C3BC85">3. Any other business</a></li>
</ul>
</div>
</div>

<div id="outline-container-h-5FD58640-0C4C-47AD-9DD2-CE42E3859295" class="outline-2">
<h2 id="h-5FD58640-0C4C-47AD-9DD2-CE42E3859295"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-h-5FD58640-0C4C-47AD-9DD2-CE42E3859295">
<p>
Approved <a href="../2024/05-14.html">at meeting 077</a> on 14 May 2024.
</p>
</div>

<div id="outline-container-h-F610AA71-DC40-4E3E-A05D-568CABACE015" class="outline-3">
<h3 id="h-F610AA71-DC40-4E3E-A05D-568CABACE015"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-h-F610AA71-DC40-4E3E-A05D-568CABACE015">
<p>
Regrets from NW, JLY. MSM to chair. <code>[7/12]</code>
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Reece Dunn (RD). <i>Regrets.</i></li>
<li class="off"><code>[&#xa0;]</code> Sasha Firsov (SF)</li>
<li class="on"><code>[X]</code> Christian Grün (CG)</li>
<li class="on"><code>[X]</code> Joel Kalvesmaki (JK)</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="off"><code>[&#xa0;]</code> Juri Leino (JLO)</li>
<li class="off"><code>[&#xa0;]</code> John Lumley (JLY). <i>Regrets.</i></li>
<li class="on"><code>[X]</code> Dimitre Novatchev (DN)</li>
<li class="on"><code>[X]</code> Wendell Piez (WP)</li>
<li class="on"><code>[X]</code> Ed Porter (EP)</li>
<li class="on"><code>[X]</code> C. M. Sperberg-McQueen (MSM). <i>Scribe. Chair.</i></li>
<li class="off"><code>[&#xa0;]</code> Norm Tovey-Walsh (NW). <i>Regrets.</i></li>
</ul>
</div>
</div>


<div id="outline-container-h-B1C3720D-A852-416F-8CA8-F796F8B4928E" class="outline-3">
<h3 id="h-B1C3720D-A852-416F-8CA8-F796F8B4928E"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-h-B1C3720D-A852-416F-8CA8-F796F8B4928E">
<p>
Proposal:  Accept <a href="https://qt4cg.org/meeting/agenda/2024/05-07.html">the agenda</a> as posted.
</p>

<p>
MK says that PR #1181 belongs in the general list, not XSLT-focused, as
it affects all specs.
</p>

<p>
CG: can we prioritize 1068?
</p>

<p>
Accepted as modified.
</p>
</div>
</div>

<div id="outline-container-h-AD4E2248-E237-42B4-987B-745B7073F0BD" class="outline-3">
<h3 id="h-AD4E2248-E237-42B4-987B-745B7073F0BD"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-h-AD4E2248-E237-42B4-987B-745B7073F0BD">
<p>
MSM urged the group to look carefully at the status visualizations at
the beginning of each week's minutes.  The number of open bugs is
improving, but (a) the overall trend line is still ascending and (b)
the number of issues is still well into triple digits.
</p>

<p>
Proposal:  Accept <a href="https://qt4cg.org/meeting/minutes/2024/04-30.html">minutes of the previous meeting</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-h-6E415DD8-5C33-4E06-A5CA-DB9AC4955455" class="outline-3">
<h3 id="h-6E415DD8-5C33-4E06-A5CA-DB9AC4955455"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-h-6E415DD8-5C33-4E06-A5CA-DB9AC4955455">
<p>
The next meeting is scheduled for
<a href="https://qt4cg.org/meeting/agenda/2024/05-14.html">14 May</a>. The following
meeting is scheduled for 21 May.
</p>

<p>
MSM noted that he and NW have a conflicting meeting, but having just
harangued the group on the subject of improving the burn-down rate, he
felt incapable of proposing that we skip the meeting.  So: we <b>will</b>
meet on 14 May, and NW and MSM will have to sneak out of their other
meeting.
</p>
</div>
</div>


<div id="outline-container-h-1C7F6C83-ADC6-4CE8-9C43-C68FC17DFCF3" class="outline-3">
<h3 id="h-1C7F6C83-ADC6-4CE8-9C43-C68FC17DFCF3"><span class="section-number-3">1.5.</span> Review of open action items <code>[1/7]</code></h3>
<div class="outline-text-3" id="text-h-1C7F6C83-ADC6-4CE8-9C43-C68FC17DFCF3">
<p>
(Items marked [X] are believed to have been closed via email before this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-063-06: MK to consider refactoring the declare item type syntax to something like declare record</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-071-06: NW to clarify the cases that are distinguished by the leading empty string in path segments</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-072-03: NW to clarify the round-tripping of URIs</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-073-01: NW to proceed with the records/options proposal and make a PR.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-075-01: MK to drop the deterministic option and raise it as a separate issue.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-075-02: MK to define sequence-concatenation more formally with links where appropriate</li>
<li class="on"><code>[X]</code> QT4CG-075-03: CG to make changes to map:values analagous to MK’s changes to array:values</li>
</ul>

<p>
MK reports he's done half of 075-01.  
</p>

<p>
CG has made a PR satisfying 075-03.
</p>
</div>
</div>

<div id="outline-container-h-B9D86C17-B569-479B-9148-AA10721BBA6C" class="outline-3">
<h3 id="h-B9D86C17-B569-479B-9148-AA10721BBA6C"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-h-B9D86C17-B569-479B-9148-AA10721BBA6C">
</div>

<div id="outline-container-h-2E27F717-E026-4E76-8867-3D13A65059E3" class="outline-4">
<h4 id="h-2E27F717-E026-4E76-8867-3D13A65059E3"><span class="section-number-4">1.6.1.</span> XSLT focused</h4>
<div class="outline-text-4" id="text-h-2E27F717-E026-4E76-8867-3D13A65059E3">
<p>
The following PRs appear to be candidates for a future XSLT-focused
meeting.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1015">#1015</a>: 1013 [XSLT] Clarify</li>
</ul>
<p>
effect of accumulator capture on non-element nodes
</p>
<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-921">#921</a>: 920 Allow xsl:break and</li>
</ul>
<p>
xsl:next-iteration within branch of xsl:switch
</p>
<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-871">#871</a>: Action qt4 cg 027 01 next match</li>
</ul>

<p>
These issues identify the XSLT-focused changes that have been made to
the specifications but which have not been established by the
community group as the status quo.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/168">#168</a>: XSLT Extension</li>
</ul>
<p>
Instructions invoking Named Templates
</p>

<p>
We removed PR <a href="https://qt4cg.org/dashboard/#pr-1181">#1181</a> from this list and moved it to the next section.
</p>
</div>
</div>

<div id="outline-container-h-777CB2A2-C144-480C-859C-1A2E43163364" class="outline-4">
<h4 id="h-777CB2A2-C144-480C-859C-1A2E43163364"><span class="section-number-4">1.6.2.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-h-777CB2A2-C144-480C-859C-1A2E43163364">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1186">#1186</a>: 1170 Editorial: fn:index-where</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1185">#1185</a>: 1179 array:values, map:values → contents</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1184">#1184</a>: 1165-Use Unicode-style character references</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1182">#1182</a>: 1171 Change predicate</li>
</ul>
<p>
callbacks to allow empty return value
</p>
<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1148">#1148</a>: 1143 Coercion rules:</li>
</ul>
<p>
handle choice types before atomization
</p>
<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1117">#1117</a>: 1116 Add options param to unparsed-text</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1108">#1108</a>: 566-partial Describe a</li>
</ul>
<p>
less aggressive %-encoding for fn:build-uri
</p>
<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1098">#1098</a>: 566-partial Editorial improvements for parse-uri</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1068">#1068</a>: 73 fn:graphemes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1062">#1062</a>: 150bis - revised proposal for fn:ranks</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1027">#1027</a>: 150 fn:ranks</li>
</ul>

<p>
We added:
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1181">#1181</a>: 296 Allow default-namespace=##any</li>
</ul>
</div>
</div>
</div>
</div>


<div id="outline-container-h-92D0ACD0-9BC3-4389-9479-CBEBFC2419E2" class="outline-2">
<h2 id="h-92D0ACD0-9BC3-4389-9479-CBEBFC2419E2"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-h-92D0ACD0-9BC3-4389-9479-CBEBFC2419E2">
</div>

<div id="outline-container-h-C7830527-6C52-4E7B-AFCF-A826F4B1F550" class="outline-3">
<h3 id="h-C7830527-6C52-4E7B-AFCF-A826F4B1F550"><span class="section-number-3">2.1.</span> PR <a href="https://qt4cg.org/dashboard/#pr-1186">#1186</a>: 1170 Editorial: fn:index-where</h3>
<div class="outline-text-3" id="text-h-C7830527-6C52-4E7B-AFCF-A826F4B1F550">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1186">#1186</a>.
</p>

<p>
Accept and close.
</p>
</div>
</div>

<div id="outline-container-h-0B28CDC3-EB80-49BD-8171-A9E7BC2E019F" class="outline-3">
<h3 id="h-0B28CDC3-EB80-49BD-8171-A9E7BC2E019F"><span class="section-number-3">2.2.</span> PR <a href="https://qt4cg.org/dashboard/#pr-1185">#1185</a>: 1179 array:values, map:values → contents</h3>
<div class="outline-text-3" id="text-h-0B28CDC3-EB80-49BD-8171-A9E7BC2E019F">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1185">#1185</a>.
</p>

<p>
MK: the problem is that 'contains' looks at keys, and 'contents' looks
at key-values.
</p>

<p>
MSM: 'value' is overloaded; that's part of theproblem, right?
</p>

<p>
CG maybe item?
</p>

<p>
DN: sequence concatenation in undefined order?  Yow!
</p>

<p>
These functions lose the structure!  This isn't a great way to get at
the parts of an array or map.
</p>

<p>
MK: Yes.  But so many arrays have singleton values that the
requirement to move from array to sequence is a very common one.
</p>

<p>
JK: what's the intended difference between array:content() and
array:flatten()?  CG: contents() is much simpler.
</p>

<p>
CG: the motivation for these is to allow functional equivalents for a
widely used wildcard syntax.
</p>

<p>
Various people: would 'flatten' be a better name?
</p>

<p>
CN: or flattened-value()?
</p>

<p>
CN:  loss of information is the issue.  array:squashed(),  maps:squashed().
</p>

<p>
Further consideration needed.  Take it offline.
</p>
</div>
</div>



<div id="outline-container-h-D8882D53-D962-4A76-8AF6-68CCA1B84C9A" class="outline-3">
<h3 id="h-D8882D53-D962-4A76-8AF6-68CCA1B84C9A"><span class="section-number-3">2.3.</span> PR <a href="https://qt4cg.org/dashboard/#pr-1184">#1184</a>: 1165-Use Unicode-style character references</h3>
<div class="outline-text-3" id="text-h-D8882D53-D962-4A76-8AF6-68CCA1B84C9A">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1184">#1184</a>.
</p>

<p>
MK: purely editorial.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-h-55CEF04C-9E1E-48A3-A445-20A06CD23939" class="outline-3">
<h3 id="h-55CEF04C-9E1E-48A3-A445-20A06CD23939"><span class="section-number-3">2.4.</span> PR <a href="https://qt4cg.org/dashboard/#pr-1182">#1182</a>: 1171 Change predicate</h3>
<div class="outline-text-3" id="text-h-55CEF04C-9E1E-48A3-A445-20A06CD23939">
<p>
callbacks to allow empty return value
</p>

<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1182">#1182</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>


<div id="outline-container-h-706A7B88-ABA8-4A39-A41C-D3FAF396F7E0" class="outline-3">
<h3 id="h-706A7B88-ABA8-4A39-A41C-D3FAF396F7E0"><span class="section-number-3">2.5.</span> PR <a href="https://qt4cg.org/dashboard/#pr-1148">#1148</a>: 1143 Coercion rules:</h3>
<div class="outline-text-3" id="text-h-706A7B88-ABA8-4A39-A41C-D3FAF396F7E0">
<p>
handle choice types before atomization
</p>

<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-1148">#1148</a>
</p>

<p>
DN asks for more examples.  Text nodes?
</p>

<p>
ACTION:  MK to draft an editorial proposal to add more examples.
</p>
</div>
</div>
</div>

<div id="outline-container-h-BE122C76-CD86-48A2-9360-6E61E3C3BC85" class="outline-2">
<h2 id="h-BE122C76-CD86-48A2-9360-6E61E3C3BC85"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-h-BE122C76-CD86-48A2-9360-6E61E3C3BC85">
<p>
None.
</p>
</div>
</div>
</div>
</body>
</html>
